Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject Constructor
Overload List
Name | Description
ReferenceModelObject()
 Creates a new reference model object instance.
ReferenceModelObject(Int32, Identifier)
 Creates a new reference model object instance using the given parameters.
Top
See Also
Reference
ReferenceModelObject Class
Tekla.Structures.Model Namespace